       IDENTIFICATION DIVISION.
       PROGRAM-ID. STR-BITS-TO-NUMERIC.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       LINKAGE SECTION.
           01 STR-BITS PIC X(32).
           01 K PIC 99.
           01 BASE USAGE BINARY-LONG UNSIGNED.
           01 RESULT USAGE BINARY-LONG UNSIGNED.
       PROCEDURE DIVISION USING STR-BITS.
           SET BASE TO 1.
           PERFORM VARYING K FROM 64 BY -1 UNTIL K IS EQUAL 0
            IF STR-BITS(K:1) EQUAL "1" THEN
             ADD BASE TO RESULT
            END-IF
            COMPUTE BASE = BASE * 2
           END-PERFORM.
           DISPLAY RESULT.
       END PROGRAM STR-BITS-TO-NUMERIC.